<details><summary>Digger run report at 2023-10-11 17:59:42 (UTC)</summary>
                <details><summary>Plan for <b>rimvydascivilis/alpha-infra#live_staging_data</b></summary>
  
```terraform
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v5.20.1

Terraform has been successfully initialized!
data.aws_availability_zones.available: Reading...
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

  ```
</details>

<details><summary>Terraform plan validation check (live_staging_data)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details><summary>Plan for <b>rimvydascivilis/alpha-infra#live_staging_eks</b></summary>
  
```terraform
Terraform will perform the following actions:

  # module.eks_managed_node_group["general"].aws_eks_node_group.this[0] must be replaced
+/- resource "aws_eks_node_group" "this" {
      ~ ami_type               = "AL2_x86_64" -> (known after apply)
      ~ arn                    = "arn:aws:eks:us-east-1:039454511521:nodegroup/eks-staging/general-2023101116590185050000000e/eec58fd6-b6a1-962c-c04b-481ab39644d9" -> (known after apply)
      ~ disk_size              = 0 -> (known after apply)
      ~ id                     = "eks-staging:general-2023101116590185050000000e" -> (known after apply)
      ~ instance_types         = [ # forces replacement
          - "t2.micro",
          + "t4g.small",
        ]
      - labels                 = {} -> null
      ~ node_group_name        = "general-2023101116590185050000000e" -> (known after apply)
      ~ release_version        = "1.28.1-20231002" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-general-2023101116590185050000000e-eec58fd6-b6a1-962c-c04b-481ab39644d9"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> (known after apply)
      ~ status                 = "ACTIVE" -> (known after apply)
        tags                   = {
            "Environment" = "staging"
            "Name"        = "general"
            "Terraform"   = "true"
        }
        # (7 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-07bd5fd8cd491a8bc"
          ~ name    = "general-2023101116590137070000000c" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ scaling_config {
          ~ desired_size = 4 -> 2
            # (2 unchanged attributes hidden)
        }

      ~ update_config {
          - max_unavailable            = 0 -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ eks_managed_node_groups                          = {
      ~ general = {
          ~ node_group_arn                     = "arn:aws:eks:us-east-1:039454511521:nodegroup/eks-staging/general-2023101116590185050000000e/eec58fd6-b6a1-962c-c04b-481ab39644d9" -> (known after apply)
          ~ node_group_autoscaling_group_names = [
              - "eks-general-2023101116590185050000000e-eec58fd6-b6a1-962c-c04b-481ab39644d9",
            ] -> (known after apply)
          ~ node_group_id                      = "eks-staging:general-2023101116590185050000000e" -> (known after apply)
          ~ node_group_labels                  = {} -> null
          ~ node_group_resources               = [
              - {
                  - autoscaling_groups              = [
                      - {
                          - name = "eks-general-2023101116590185050000000e-eec58fd6-b6a1-962c-c04b-481ab39644d9"
                        },
                    ]
                  - remote_access_security_group_id = ""
                },
            ] -> (known after apply)
          ~ node_group_status                  = "ACTIVE" -> (known after apply)
            # (10 unchanged attributes hidden)
        }
    }
  ~ eks_managed_node_groups_autoscaling_group_names  = [
      - "eks-general-2023101116590185050000000e-eec58fd6-b6a1-962c-c04b-481ab39644d9",
    ] -> (known after apply)

Warning: Argument is deprecated

  with aws_eks_addon.this["vpc-cni"],
  on main.tf line 392, in resource "aws_eks_addon" "this":
 392:   resolve_conflicts        = try(each.value.resolve_conflicts, "OVERWRITE")

The "resolve_conflicts" attribute can't be set to "PRESERVE" on initial
resource creation. Use "resolve_conflicts_on_create" and/or
"resolve_conflicts_on_update" instead

(and 2 more similar warnings elsewhere)

  ```
</details>


<details><summary>Terraform plan validation check (live_staging_eks)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details><summary>Plan for <b>rimvydascivilis/alpha-infra#live_staging_k8s-addons</b></summary>
  
```terraform
Terraform will perform the following actions:

  # helm_release.argocd[0] is tainted, so must be replaced
-/+ resource "helm_release" "argocd" {
      ~ id                         = "argocd" -> (known after apply)
      + manifest                   = (known after apply)
      ~ metadata                   = [
          - {
              - app_version = "v2.8.4"
              - chart       = "argo-cd"
              - name        = "argocd"
              - namespace   = "argocd"
              - revision    = 1
              - values      = jsonencode(
                    {
                      - global = {
                          - image = {
                              - tag = "v2.8.4"
                            }
                        }
                      - server = {
                          - extraArgs = [
                              - "--insecure",
                            ]
                          - ingress   = {
                              - annotations = {
                                  - "alb.ingress.kubernetes.io/group.name"  = "default"
                                  - "alb.ingress.kubernetes.io/group.order" = 1
                                  - "alb.ingress.kubernetes.io/scheme"      = "internet-facing"
                                }
                              - enabled     = true
                              - hosts       = [
                                  - "argocd.staging.example.com",
                                ]
                              - paths       = [
                                  - "/",
                                ]
                            }
                          - service   = {
                              - type = "NodePort"
                            }
                        }
                    }
                )
              - version     = "5.46.7"
            },
        ] -> (known after apply)
        name                       = "argocd"
      ~ status                     = "failed" -> "deployed"
        # (25 unchanged attributes hidden)

        # (9 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

  ```
</details>


<details><summary>Terraform plan validation check (live_staging_k8s-addons)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details><summary>Plan for <b>rimvydascivilis/alpha-infra#live_staging_vpc</b></summary>
  
```terraform
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v5.20.1

Terraform has been successfully initialized!
aws_vpc.this[0]: Refreshing state... [id=vpc-0b06587589003f692]
aws_default_security_group.this[0]: Refreshing state... [id=sg-08e02bfd5e35a65ba]
aws_default_network_acl.this[0]: Refreshing state... [id=acl-0376435ce8eaec99a]
aws_default_route_table.default[0]: Refreshing state... [id=rtb-05e0896259da39a35]
aws_subnet.public[0]: Refreshing state... [id=subnet-082930781bc71f66e]
aws_subnet.private[2]: Refreshing state... [id=subnet-0fd8af2e73e3eca63]
aws_subnet.public[2]: Refreshing state... [id=subnet-061f8c01800fe4990]
aws_route_table.private[0]: Refreshing state... [id=rtb-0368c49be9635d56a]
aws_internet_gateway.this[0]: Refreshing state... [id=igw-0f44dc54ec260b934]
aws_subnet.private[0]: Refreshing state... [id=subnet-097e8b49199a9589c]
aws_subnet.public[1]: Refreshing state... [id=subnet-069bcbb444187b8d3]
aws_subnet.private[1]: Refreshing state... [id=subnet-0ea0a6020a9ea2267]
aws_subnet.intra[2]: Refreshing state... [id=subnet-080198afe05465cd5]
aws_subnet.intra[0]: Refreshing state... [id=subnet-03fd5e3083552f5a7]
aws_subnet.intra[1]: Refreshing state... [id=subnet-0006896ff4a4fc9a7]
aws_route_table.public[0]: Refreshing state... [id=rtb-0e2043b6155953690]
aws_route_table.intra[0]: Refreshing state... [id=rtb-0826a7465497b63b4]
aws_eip.nat[0]: Refreshing state... [id=eipalloc-0e3dc6a4c9b106e17]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0f12120e316c6ce2f]
aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-01202d470ffc9d65c]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-02c612d760080871b]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-033b8224cd7391f4d]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0d2aa74617772bf89]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0c4d2e356010404e6]
aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0e2043b61559536901080289494]
aws_route_table_association.intra[1]: Refreshing state... [id=rtbassoc-05b7210f51844a3ac]
aws_route_table_association.intra[2]: Refreshing state... [id=rtbassoc-0f9a069cb51db9c81]
aws_route_table_association.intra[0]: Refreshing state... [id=rtbassoc-0dfd6713086173fa3]
aws_nat_gateway.this[0]: Refreshing state... [id=nat-0301ab814236b6ce7]
aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0368c49be9635d56a1080289494]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

  ```
</details>


<details><summary>Terraform plan validation check (live_staging_vpc)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>

</details>